# Create Method (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
LineLoad..::..Create Method
LineLoad Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create(Document, AnalyticalModelStick, XYZ, XYZ, LineLoadType) | Creates a new hosted line load within the project. |
| Create(Document, AnalyticalModelSurface, Int32, XYZ, XYZ, LineLoadType) | Creates a new hosted line load within the project. |
| Create(Document, XYZ, XYZ, XYZ, XYZ, LineLoadType, SketchPlane) | Creates a new non-hosted line load within the project using data at point. |

# See Also
LineLoad Class
LineLoad Members
Autodesk.Revit.DB.Structure Namespace